<template>
    <div>
        <FieldSelect v-model="fieldValue" :options="options" />
    </div>
</template>
<script setup lang="ts">

import { ref, watch } from 'vue';
import type { FieldSelectOptions } from './FieldSelect';
import FieldSelect from './FieldSelect.vue';
const options: FieldSelectOptions = {
    keyField: "отделение_id",
    displayField: "аббр",
    columns: ["аббр", 'наименование'],
    data: [{ отделение_id: 1172, аббр: 'ЭСБ-КГО', наименование: 'Филиал АО "Татэнергосбыт" - Казанское городское отделение' },
    { отделение_id: 1210, аббр: 'ЭСБ-АЛ', наименование: 'Филиал АО "Татэнергосбыт" - Альметьевское отделение' },
    { отделение_id: 1211, аббр: 'ЭСБ-БГ', наименование: 'Филиал АО "Татэнергосбыт" - Бугульминское отделение' },
    { отделение_id: 1212, аббр: 'ЭСБ-БУ', наименование: 'Филиал АО "Татэнергосбыт" - Буинское отделение' },
    { отделение_id: 1214, аббр: 'ЭСБ-ЕЛ', наименование: 'Филиал АО "Татэнергосбыт" - Елабужское отделение' },
    { отделение_id: 1215, аббр: 'ЭСБ-НЧ', наименование: 'Филиал АО "Татэнергосбыт" - Набережночелнинское отделение' },
    { отделение_id: 1216, аббр: 'ЭСБ-ПР', наименование: 'Филиал АО "Татэнергосбыт" - Приволжское отделение' },
    { отделение_id: 1217, аббр: 'ЭСБ-ЧИ', наименование: 'Филиал АО "Татэнергосбыт" - Чистопольское отделение' },
    { отделение_id: 1218, аббр: 'ЭСБ-НК', наименование: 'Филиал АО "Татэнергосбыт" - Камское отделение' },
    { отделение_id: 1219, аббр: 'ЭСБ-УПР', наименование: 'Управление АО "Татэнергосбыт"' },]
}


const props = defineProps({
    modelValue: {
        type: Array,
        required: false
    }
});

const fieldValue = ref(props.modelValue);

const emit = defineEmits(['update:modelValue']);

watch(fieldValue, (newValue, oldValue) => {
    emit('update:modelValue', newValue);
});


</script>