with -- n as (
--     select a.договор_ид,
--         a.вид_реал_ид,
--         a.вид_тов_ид,
--         p.год,
--         p.месяц,
--         3 as порядок,
--         sum(a.начисл) сумма
--     from report_dm.msr_фин_обор a
--         join report_dev.период p on a.дата between p.дата_с and p.дата_по
--         and p.договор_ид = a.договор_ид
--     where a.начисл is not null
--         and p.год = 2019
--         and p.месяц = 1
--     group by a.договор_ид,
--         a.вид_реал_ид,
--         a.вид_тов_ид,
--         p.год,
--         p.месяц
-- ),
ok as (
    select a.договор_ид,
        p.год,
        p.месяц,
        2 вид_реал_ид,
        sum(a.опл_кред_перепл) опл_кред_перепл,
        sum(a.опл_кред_аванс) опл_кред_аванс
    from report_dm.msr_фин_опл_кредит a
        join report_dev.период p on a.дата between p.дата_с and p.дата_по
        and p.договор_ид = a.договор_ид
    where p.год = 2019
        and p.месяц = 1
    group by a.договор_ид,
        p.год,
        p.месяц
),
o1 as (
    select a.договор_ид,
        74 as вид_тов_ид,
        a.год,
        a.месяц,
        a.вид_реал_ид,
        2 as порядок,
        a.опл_кред_перепл сумма
    from ok a
    where опл_кред_перепл != 0
),
o2 as (
    select a.договор_ид,
        75 as вид_тов_ид,
        a.год,
        a.месяц,
        a.вид_реал_ид,
        2 as порядок,
        a.опл_кред_аванс сумма
    from ok a
    where опл_кред_аванс != 0
),
op as (
    select a.договор_ид,
        a.вид_реал_ид,
        p.год,
        p.месяц,
        sum(a.погаш_оплатой) погаш_оплатой,
        sum(a.погаш_из_кред) погаш_из_кред
    from report_dm.msr_фин_опл_погаш a
        join report_dev.период p on a.дата between p.дата_с and p.дата_по
        and p.договор_ид = a.договор_ид
    where p.год = 2019
        and p.месяц = 1
    group by a.договор_ид,
        a.вид_реал_ид,
        p.год,
        p.месяц
),
o3 as (
    select 'Оплачено' as имя_стр,
        a.договор_ид,
        a.вид_реал_ид,
        a.год,
        a.месяц,
        3 as порядок,
        a.погаш_оплатой сумма
    from op a
    where погаш_оплатой != 0
),
o4 as (
    select 'Погашение факта' as имя_стр,
        a.договор_ид,
        a.вид_реал_ид,
        a.год,
        a.месяц,
        3 as порядок,
        a.погаш_из_кред сумма
    from op a
    where погаш_из_кред != 0
),
x as (
    -- select a.договор_ид,
    --     a.год,
    --     a.месяц,
    --     a.вид_реал_ид,
    --     a.вид_тов_ид,
    --     null as имя_стр,
    --     a.порядок,
    --     a.сумма
    -- from n a
    -- UNION ALL
    select a.договор_ид,
        a.год,
        a.месяц,
        a.вид_реал_ид,
        a.вид_тов_ид,
        null as имя_стр,
        a.порядок,
        a.сумма
    from o1 a
    UNION ALL
    select a.договор_ид,
        a.год,
        a.месяц,
        a.вид_реал_ид,
        a.вид_тов_ид,
        null as имя_стр,
        a.порядок,
        a.сумма
    from o2 a
    UNION ALL
    select a.договор_ид,
        a.год,
        a.месяц,
        a.вид_реал_ид,
        null as вид_тов_ид,
        a.имя_стр,
        a.порядок,
        a.сумма
    from o3 a
    UNION ALL
    select a.договор_ид,
        a.год,
        a.месяц,
        a.вид_реал_ид,
        null as вид_тов_ид,
        a.имя_стр,
        a.порядок,
        a.сумма
    from o4 a
) -- sn as (
--     select a.договор_ид,
--         p.год,
--         p.месяц,
--         sum(долг) сумма
--     from report_dm.msr_фин_сальдо_по_дог a
--         join report_dev.период p on p.дата_с between a.акт_с and a.акт_по
--         and p.договор_ид = a.договор_ид
--     group by a.договор_ид,
--         p.год,
--         p.месяц
-- )
select *
from x